Repository: jachik/HuntScope
Catalog: HuntScope/Localizable.xcstrings
Source language: en
Languages: de, pl

# _a11y_ads_close_button_hint
source: Dismisses the ad
de: Schließt die Werbung
pl: Zamyka reklamę

# _a11y_ads_close_button_label
source: Close ad
de: Werbung schließen
pl: Zamknij reklamę

# _a11y_ads_close_in_seconds
source: Ad can be closed in %d seconds
de: Werbung kann in %d Sekunden geschlossen werden
pl: Reklamę można zamknąć za %d sek.

# _a11y_configuration_btn_manage_hint
source: Opens Apple subscriptions
de: Öffnet Apple‑Abonnements
pl: Otwiera subskrypcje Apple

# _a11y_configuration_btn_manage_label
source: Manage subscription
de: Abo verwalten
pl: Zarządzaj subskrypcją

# _a11y_configuration_btn_purchase_hint
source: Activates the Premium subscription
de: Aktiviert das Premium‑Abo
pl: Aktywuje subskrypcję Premium

# _a11y_configuration_btn_restore_hint
source: Restores previous purchases
de: Stellt frühere Käufe wieder her
pl: Przywraca wcześniejsze zakupy

# _a11y_configuration_dialog_close_label
source: Close dialog
de: Dialog schließen
pl: Zamknij okno

# _a11y_configuration_rtsp_autoconnect_label
source: Auto‑connect camera
de: Auto‑Connect Kamera
pl: Auto‑połączenie kamery

# _a11y_configuration_rtsp_url_field_label
source: Camera URL
de: Kamera‑URL
pl: Adres URL kamery

# _a11y_layout_battery_label
source: Battery
de: Akku
pl: Bateria

# _a11y_layout_battery_state_charging
source: charging
de: lädt
pl: ładuje

# _a11y_layout_battery_state_full
source: full
de: voll
pl: pełna

# _a11y_layout_battery_state_not_charging
source: not charging
de: nicht am Laden
pl: nie ładuje

# _a11y_layout_btn_camera_hint
source: Saves a snapshot to Photos
de: Speichert einen Snapshot in Fotos
pl: Zapisuje kadr do Zdjęć

# _a11y_layout_btn_camera_label
source: Take photo
de: Foto aufnehmen
pl: Zrób zdjęcie

# _a11y_layout_btn_quit_hint
source: Closes the application
de: Schließt die App
pl: Zamyka aplikację

# _a11y_layout_btn_quit_label
source: Quit app
de: Beenden
pl: Zakończ aplikację

# _a11y_layout_btn_record_hint_start
source: Starts video recording
de: Startet die Videoaufnahme
pl: Uruchamia nagrywanie wideo

# _a11y_layout_btn_record_hint_stop
source: Stops video recording
de: Stoppt die Videoaufnahme
pl: Zatrzymuje nagrywanie wideo

# _a11y_layout_btn_record_label_start
source: Start recording
de: Aufnahme starten
pl: Rozpocznij nagrywanie

# _a11y_layout_btn_record_label_stop
source: Stop recording
de: Aufnahme stoppen
pl: Zatrzymaj nagrywanie

# _a11y_layout_btn_record_value_off
source: Not recording
de: Keine Aufnahme
pl: Brak nagrywania

# _a11y_layout_btn_record_value_on
source: Recording
de: Aufnahme läuft
pl: Nagrywanie

# _a11y_layout_btn_settings_hint
source: Opens the configuration dialog
de: Öffnet den Konfigurationsdialog
pl: Otwiera okno konfiguracji

# _a11y_layout_btn_settings_label
source: Open settings
de: Einstellungen öffnen
pl: Otwórz ustawienia

# _a11y_layout_btn_theme_hint
source: Toggles between red and white
de: Wechselt zwischen Rot und Weiß
pl: Przełącza między czerwonym i białym

# _a11y_layout_btn_theme_label
source: Change theme
de: Theme wechseln
pl: Zmień motyw

# _a11y_layout_overlay_no_signal_label
source: No video signal
de: Kein Videosignal
pl: Brak sygnału wideo

# _a11y_stream_recording_value_off
source: Not recording
de: Keine Aufnahme
pl: Brak nagrywania

# _a11y_stream_recording_value_on
source: Recording
de: Aufnahme läuft
pl: Nagrywanie

# _a11y_stream_surface_hidden_label
source: Video surface
de: Videofläche
pl: Powierzchnia wideo

source: Activate HuntScope Premium
de: HuntScope Premium freischalten
pl: Aktywuj HuntScope Premium

source: Ad asset not found
de: Werbemittel nicht gefunden
pl: Nie znaleziono materiału reklamowego

source: Camera configuration
de: Kamerakonfiguration
pl: Konfiguracja kamery

# _configuration_autoconnect_not_found
source: Camera not found
de: Kamera nicht gefunden
pl: Nie znaleziono kamery

# _configuration_autoconnect_scanning
source: Searching for cameras
de: Kameras werden gesucht
pl: Wyszukiwanie kamer

# _configuration_autoconnect_success
source: Successful
de: Erfolgreich
pl: Pomyślnie

# _configuration_camera_url_label
source: Camera URL (format rtsp://IP/resource)
de: Kamera-URL (in der Form rtsp://IP/Ressource)
pl: Adres URL kamery (format rtsp://IP/zasób)

# _configuration_close
source: Close
de: Schließen
pl: Zamknij

# _configuration_connection_establishing
source: Establishing connection
de: Verbindung wird aufgebaut
pl: Nawiązywanie połączenia

# _configuration_connection_failed
source: No connection
de: Keine Verbindung
pl: Brak połączenia

# _configuration_connection_success
source: Connection successful
de: Verbindung erfolgreich
pl: Połączenie udane

# _configuration_connection_test
source: Connection Test
de: Verbindungstest
pl: Test połączenia

# _configuration_first_launch_body
source: This is your first time using the app. Should we automatically detect your thermal camera? (You must already be connected to the camera's Wi‑Fi.)
de: Du startest die App das erste Mal. Sollen wir deine Wärmebildkamera automatisch ermitteln? (Dafür musst du bereits mit dem WLAN der Kamera verbunden sein.)
pl: To Twoje pierwsze uruchomienie aplikacji. Czy wykryć automatycznie Twoją kamerę termowizyjną? (Musisz być już połączony z siecią Wi‑Fi kamery.)

# _configuration_first_launch_no_later
source: No, later
de: Nein, später
pl: Nie, później

# _configuration_first_launch_title
source: First Launch
de: Erststart
pl: Pierwsze uruchomienie

# _configuration_first_launch_yes_auto
source: Yes, search automatically
de: Ja, automatisch suchen
pl: Tak, wyszukaj automatycznie

# _configuration_invalid_url_message
source: Invalid URL. Expected: rtsp://<IP>[:PORT]/<RESOURCE> (e.g., rtsp://192.168.1.10:554/stream)
de: Ungültige URL. Erwartet: rtsp://<IP>[:PORT]/<RESSOURCE> (z. B. rtsp://192.168.1.10:554/stream)
pl: Nieprawidłowy URL. Oczekiwano: rtsp://<IP>[:PORT]/<ZASÓB> (np. rtsp://192.168.1.10:554/stream)

# _configuration_manual_configuration
source: Manual Configuration
de: Manuelle Konfiguration
pl: Konfiguracja ręczna

# _configuration_stream_title
source: Stream Configuration
de: Stream-Konfiguration
pl: Konfiguracja strumienia

# _configuration_test_body
source: This is a test dialog based on DialogContainer.
de: Dies ist ein Test-Dialog auf Basis des DialogContainer.
pl: To jest dialog testowy oparty na DialogContainer.

# _configuration_test_note
source: Your specific settings could go here.
de: Hier könnten deine spezifischen Einstellungen stehen.
pl: Tutaj mogą znaleźć się Twoje ustawienia.

# _configuration_test_title
source: Test Configuration
de: Test-Konfiguration
pl: Konfiguracja testowa

# _configuration_title
source: Configuration
de: Konfiguration
pl: Konfiguracja

# _configuration_wifi_required_message
source: Please enable Wi‑Fi and connect to the camera.
de: Bitte WLAN aktivieren und mit Kamera verbinden.
pl: Włącz Wi‑Fi i połącz się z kamerą.

# _configuration_wifi_required_title
source: Wi‑Fi Required
de: WLAN benötigt
pl: Wymagane Wi‑Fi

# _imprint_title
source: Imprint
de: Impressum
pl: Nota prawna

# _subscription_active
source: Premium active
de: Premium aktiv
pl: Premium aktywne

# _subscription_active_until
source: Premium active until %1$@
de: Premium aktiv bis %1$@
pl: Premium aktywne do %1$@

# _subscription_benefit_adfree
source: Ad‑free — no interruptions from ads.
de: Werbefrei – keine Unterbrechungen durch Anzeigen.
pl: Bez reklam — bez przerw spowodowanych reklamami.

# _subscription_benefit_support
source: Supports ongoing app development.
de: Unterstützt die Weiterentwicklung der App.
pl: Wspiera dalszy rozwój aplikacji.

# _subscription_benefits_title
source: Benefits of HuntScope Premium
de: Vorteile von HuntScope Premium
pl: Korzyści z HuntScope Premium

# _subscription_cancelled_purchase
source: Purchase canceled.
de: Kauf abgebrochen.
pl: Zakup anulowany.

# _subscription_error_no_products
source: No products available.
de: Keine Produkte verfügbar.
pl: Brak dostępnych produktów.

# _subscription_error_product_not_found
source: Product not found.
de: Produkt nicht gefunden.
pl: Nie znaleziono produktu.

# _subscription_error_products_load
source: Couldn't load products.
de: Produkte konnten nicht geladen werden.
pl: Nie udało się wczytać produktów.

# _subscription_error_purchase_failed
source: Purchase failed.
de: Kauf fehlgeschlagen.
pl: Zakup nie powiódł się.

# _subscription_error_purchase_unverified
source: Purchase could not be verified.
de: Kauf konnte nicht verifiziert werden.
pl: Nie udało się zweryfikować zakupu.

# _subscription_error_restore_failed
source: Restore failed.
de: Wiederherstellung fehlgeschlagen.
pl: Przywracanie nie powiodło się.

# _subscription_manage_button
source: Manage Subscription
de: Abo verwalten
pl: Zarządzaj subskrypcją

# _subscription_pending_purchase
source: Purchase pending.
de: Kauf ausstehend.
pl: Zakup oczekuje na realizację.

# _subscription_per_month
source: per month
de: pro Monat
pl: miesięcznie

# _subscription_per_year
source: per year
de: pro Jahr
pl: rocznie

# _subscription_prices_loading
source: Loading prices…
de: Preise werden geladen…
pl: Trwa wczytywanie cen…

# _subscription_purchase_button
source: Unlock Premium
de: Premium freischalten
pl: Odblokuj Premium

# _subscription_restore_button
source: Restore Purchases
de: Käufe wiederherstellen
pl: Przywróć zakupy

# _subscription_select_plan
source: Choose plan
de: Abo wählen
pl: Wybierz plan

# _subscription_success_purchase
source: Purchase successful.
de: Kauf erfolgreich.
pl: Zakup zakończony powodzeniem.

# _subscription_success_restore
source: Purchases restored.
de: Käufe wiederhergestellt.
pl: Zakupy przywrócone.

# _subscription_title
source: Unlock Premium
de: Premium freischalten
pl: Odblokuj Premium

# _subscription_unknown_purchase_result
source: Unknown purchase result.
de: Unbekanntes Kauf-Ergebnis.
pl: Nieznany wynik zakupu.

# _trial_days_left
source: You’re currently in the trial period. %d days ad‑free remaining.
de: Du befindest dich gerade in der Testphase. Noch %d Tage werbefrei.
pl: Obecnie korzystasz z okresu próbnego. Pozostało %d dni bez reklam.

# _trial_intro_body
source: The app is in a 30‑day trial period. During this time, no ads are shown. Afterward, you can purchase a subscription.
de: Die App befindet sich 30 Tage in einem Testzeitraum. In dieser Zeit werden keine Anzeigen eingeblendet. Danach kann ein Abo erworben werden.
pl: Aplikacja znajduje się w 30‑dniowym okresie próbnym. W tym czasie reklamy nie są wyświetlane. Później możesz wykupić subskrypcję.

# _trial_intro_title
source: Trial Period
de: Testzeitraum
pl: Okres próbny

# _configuration_auto_connect
source: Auto‑Connect
pl: Auto‑połączenie

# _dsgvo_body
source: Click here to open the privacy policy in your browser.
pl: Kliknij tutaj, aby otworzyć politykę prywatności w przeglądarce.

# _dsgvo_title
source: Privacy Policy
pl: Polityka prywatności

# _imprint_body
source: Jacek Schikora Haydnstr. 18 56154 Boppard, Germany Email: info@j-s-edv.de VAT ID: DE231106128 Responsible for content pursuant to Section 18 (2) MStV: Jacek Schikora, address as above. Subscriptions are handled exclusively via Apple (App Store). Notice pursuant to Section 36 VSBG (Consumer Dispute Resolution Act): We are neither obliged nor willing to participate in dispute resolution proceedings before a consumer arbitration board.
pl: Jacek Schikora Haydnstr. 18 56154 Boppard, Niemcy E-mail: info@j-s-edv.de NIP (VAT UE): DE231106128 Osoba odpowiedzialna za treść zgodnie z § 18 ust. 2 MStV: Jacek Schikora, adres jak wyżej. Subskrypcje są realizowane wyłącznie za pośrednictwem Apple (App Store). Informacja zgodnie z § 36 VSBG (ustawa o pozasądowym rozwiązywaniu sporów konsumenckich): Nie jesteśmy zobowiązani ani nie wyrażamy gotowości do udziału w postępowaniach w sprawie rozstrzygania sporów przed konsumencką jednostką arbitrażową.
